import numpy as np


# 双目相机参数
class stereoCamera(object):
    def __init__(self):
        # 左相机内参
        self.cam_matrix_left = np.array([[754.564193 0.00000000 325.625702]
                                        [0.00000000 1011.40816 230.911572]
                                        [0.00000000 0.00000000 1.00000000]])
        # 右相机内参
        self.cam_matrix_right = np.array([[747.832215 0.00000000 341.544084]
                                        [0.00000000 1001.98646 216.494991]
                                        [0.00000000 0.00000000 1.00000000]])

        # 左右相机畸变系数:[k1, k2, p1, p2, k3]
        self.distortion_l = np.array([[ 0.07535038 -0.17302545 -0.00700741  0.0053849   0.02221964]])
        self.distortion_r = np.array([[ 0.18894066 -1.12184585 -0.00543849  0.00367744  2.61674636]])

        # 旋转矩阵（我的是固定好的，所以转矩阵是单位矩阵）
        self.R = np.array([[ 0.99992092 -0.0035188  -0.01207344]
                            [ 0.00356809  0.99998538  0.0040632 ]
                            [ 0.01205897 -0.00410596  0.99991886]])

        # 平移矩阵
        self.T = np.array([[25.92889771], [-0.11874199], [-1.05051296]])

        # 焦距
        self.focal_length = 1602.46406  # 默认值，一般取立体校正后的重投影矩阵Q中的 Q[2,3]

        # 基线距离
        self.baseline = 1.39089984389539E-13  # 单位：mm， 为平移向量的第一个参数（取绝对值）